#+title:      B Klasse 2023-27
#+date:       [2023-07-08 Sa 14:39]
#+filetags:   :1b:Project:
#+identifier: 20230708T143945
#+CATEGORY: golling

* 1b 07:45-08:35
<%%(org-class 2022 9 12 2023 7 3 1 27)>
Hier kommt mein Text. Und da schreibe ich weiter. Ist das wirklich besser zum Lesen? Ich bin mir nicht so sicher. Was denken andere, wenn sie diesen Text lesen? Hm... So sieht der Text eigentlich recht sauber und klar aus. In der Iosevka Comfy Wide Fixed sieht der Text für meinen Geschmack jedoch besser lesbar aus als in der Iosevka Aile oder der regulären Iosevka. Jetbrains Mono wäre auch noch eine Alternative. Ich hab mich von der Iosevka CWF verabschiedet; eventuell war meine Installation nicht korrekt. Ich kehre zu Jetbrains Mono zurück und habe in allen Programmen und va auf dem ganzen System die Schriftarten geändert.

Eigentlich habe ich bisher die 'headings' und den file-title größer geschrieben - mit modus-themes-headings lässt sich das sehr gut und einfach konfigurieren. Jetzt habe ich bei prot nachgeschaut: er verändert nur die org-agenda. Die Headings in org-mode bleiben gleich groß, es ändert sich nur die Farbe (blau oder violett). Prot hat Recht: schließlich ist es Text - es muss nicht all zu fancy sein. Die Headings sind fett, das genügt als Hervorhebung.

Ich habe seine Konfiguration von den modus-themes übernommen - schaut sehr schön aus - alles ist in einem "Lavendel"-Stil.

Jetzt sollte ich beginen, das Schuljahr und die Themen genauer vorzubereiten. Emacs hab ich ausreichend konfiguriert. Die Schriftgröße habe ich v.a. in Emacs con 12 auf 13 erhöht (so wird es auf der Homepage von JetBrains Mono vorgeschlagen: [[https://www.jetbrains.com/lp/mono/]]). Diese kleine Änderung hat eine relativ große Wirkung und verbessert die Lesbarkeit des Textes. Und meine Augen müssen sich erst an die neue Schriftgröße gewöhnen.

Dieser ständige Regen nervt sehr. Wann hört er auf? Ich denke an all die armen Menschen, die unter Hochwasser leiden müssen. Manchmal wird das Datum rechts in der Modeline schwarz (statt rot). Woran liegt das?

Heute <2023-08-09 Mi> ist die Version 1.3.0 der 'ef-themes' erschienen: [[https://protesilaos.com/codelog/2023-08-09-ef-themes-1-3-0/]] und: [[https://protesilaos.com/codelog/2023-07-22-ef-maris-dark-light/]].

Darunter gibt es die neuen Varianten 'ef-maris-light' und 'ef-maris-dark'. Beide bläulich - für Umgebungen, die weder sehr hell noch sehr dunkel sind. Ich verwende jetzt beide maris-Varianten - ich muss sagen: wunderschön. Da bleibe ich jetzt. Und komme wahrscheinlich wieder zu den modus-themes zurück. 


* 1b 07:45-08:35
<%%(org-class 2022 9 12 2023 7 3 1 27)>


* 1B [KV Gertraud Viertbauer]
#+Name: 2021-students
| First     | Last          | Name                 | Note | Mitarbeit | Heft | LZK |
|-----------+---------------+----------------------+------+-----------+------+-----|
| Marko     | Davidovic     | [[Marko Davidovic][Marko Davidovic]]      |    1 |           |      |     |
| Elias     | Galler        | [[Elias Galler][Elias Galler]]         |    1 |           |      |     |
| Emma      | Hansmann      | [[Emma Hansmann][Emma Hansmann]]        |    1 |           |      |     |
| Magdalena | Höllbacher    | [[Magdalena Höllbacher][Magdalena Höllbacher]] |    1 |           |      |     |
| Julia     | Höllweger     | [[Julia Höllweger][Julia Höllweger]]      |    1 |           |      |     |
| Rudolf    | Jochinger     | [[Rudolf Jochinger][Rudolf Jochinger]]     |    1 |           |      |     |
| Martin    | Kappacher     | [[Martin Kappacher][Martin Kappacher]]     |    1 |           |      |     |
| Laura     | Klausner      | [[Laura Klausner][Laura Klausner]]       |    1 |           |      |     |
| Sophia    | Korten        | [[Sophia Korten][Sophia Korten]]        |    1 |           |      |     |
| Lisa      | Kronreif      | [[Lisa Kronreif][Lisa Kronreif]]        |    1 |           |      |     |
| Peter     | Kronreif      | [[Peter Kronreif][Peter Kronreif]]       |    1 |           |      |     |
| Anna-Mae  | Leierer       | [[Anna-Mae Leierer][Anna-Mae Leierer]]     |    1 |           |      |     |
| Raphael   | Neureiter     | [[Raphael Neureiter][Raphael Neureiter]]    |    1 |           |      |     |
| Felix     | Putz          | [[Felix Putz][Felix Putz]]           |    1 |           |      |     |
| Klara     | Schmitzberger | [[Klara Schmitzberger][Klara Schmitzberger]]  |    1 |           |      |     |
| Elisabeth | Seigmann      | [[Elisabeth Seigmann][Elisabeth Seigmann]]   |    1 |           |      |     |
| Bianca    | Spagolla      | [[Bianca Spagolla][Bianca Spagolla]]      |    1 |           |      |     |
| Ilija     | Zivkovic      | [[Ilija Zivkovic][Ilija Zivkovic]]       |      |           |      |     |
|-----------+---------------+----------------------+------+-----------+------+-----|
#+TBLFM: $4=vmean($5..$>)
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(2021-22-Mitarbeit,@@#$2))

#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':END: ')
      print('\n\n')
#+END_SRC

#+RESULTS:
* Mitarbeit
# In diese Tabelle trage ich die Mitarbeit während 10 Schulwochen ein. Danach kann ich mit der ersten Tabellenformel die aktuelle Durchschnittsnote errechnen. Diese kann ich in die obige Tabelle übernehmen. Nach 23 Wochen (dh einem Semster) müsste ich die Tabelle wieder leeren - hm, gibt es keine bessere Lösung? Eine Tabelle mit allen 43 Schulwochen wäre zu groß. Mit 'C-c TAB' kann ich einzelne Spalten ein- und ausklappen. Wie geht das mit mehreren Spalten?
#+Name: Mitarbeit
| Name                 | Note | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 | 11 |
|----------------------+------+---+---+---+---+---+---+---+---+---+----+----|
| [[Marko Davidovic][Marko Davidovic]]      |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Elias Galler][Elias Galler]]         |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Emma Hansmann][Emma Hansmann]]        |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Magdalena Höllbacher][Magdalena Höllbacher]] |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Julia Höllweger][Julia Höllweger]]      |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Rudolf Jochinger][Rudolf Jochinger]]     |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Martin Kappacher][Martin Kappacher]]     |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Laura Klausner][Laura Klausner]]       |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Sophia Korten][Sophia Korten]]        |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Lisa Kronreif][Lisa Kronreif]]        |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Peter Kronreif][Peter Kronreif]]       |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Anna-Mae Leierer][Anna-Mae Leierer]]     |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Raphael Neureiter][Raphael Neureiter]]    |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Felix Putz][Felix Putz]]           |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Klara Schmitzberger][Klara Schmitzberger]]  |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Elisabeth Seigmann][Elisabeth Seigmann]]   |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Bianca Spagolla][Bianca Spagolla]]      |      |   |   |   |   |   |   |   |   |   |    |    |
| [[Ilija Zivkovic][Ilija Zivkovic]]       |      |   |   |   |   |   |   |   |   |   |    |    |
#+TBLFM: $2=vmean($3..$>)
#+TBLFM: $1='(identity remote(2021-students,@@#$3))

** Marko Davidovic
:PROPERTIES:
:EMAIL: [[mailto: Marko Davidovic <Marko.Davidovic@golling.schule>]]
:END: 



** Elias Galler
:PROPERTIES:
:EMAIL: [[mailto: Elias Galler <Elias.Galler@golling.schule>]]
:END: 



** Emma Hansmann
:PROPERTIES:
:EMAIL: [[mailto: Emma Hansmann <Emma.Hansmann@golling.schule>]]
:END: 



** Magdalena Höllbacher
:PROPERTIES:
:EMAIL: [[mailto: Magdalena Höllbacher <Magdalena.Höllbacher@golling.schule>]]
:END: 



** Julia Höllweger
:PROPERTIES:
:EMAIL: [[mailto: Julia Höllweger <Julia.Höllweger@golling.schule>]]
:END: 



** Rudolf Jochinger
:PROPERTIES:
:EMAIL: [[mailto: Rudolf Jochinger <Rudolf.Jochinger@golling.schule>]]
:END: 



** Martin Kappacher
:PROPERTIES:
:EMAIL: [[mailto: Martin Kappacher <Martin.Kappacher@golling.schule>]]
:END: 



** Laura Klausner
:PROPERTIES:
:EMAIL: [[mailto: Laura Klausner <Laura.Klausner@golling.schule>]]
:END: 



** Sophia Korten
:PROPERTIES:
:EMAIL: [[mailto: Sophia Korten <Sophia.Korten@golling.schule>]]
:END: 



** Lisa Kronreif
:PROPERTIES:
:EMAIL: [[mailto: Lisa Kronreif <Lisa.Kronreif@golling.schule>]]
:END: 



** Peter Kronreif
:PROPERTIES:
:EMAIL: [[mailto: Peter Kronreif <Peter.Kronreif@golling.schule>]]
:END: 



** Anna-Mae Leierer
:PROPERTIES:
:EMAIL: [[mailto: Anna-Mae Leierer <Anna-Mae.Leierer@golling.schule>]]
:END: 



** Raphael Neureiter
:PROPERTIES:
:EMAIL: [[mailto: Raphael Neureiter <Raphael.Neureiter@golling.schule>]]
:END: 



** Felix Putz
:PROPERTIES:
:EMAIL: [[mailto: Felix Putz <Felix.Putz@golling.schule>]]
:END: 



** Klara Schmitzberger
:PROPERTIES:
:EMAIL: [[mailto: Klara Schmitzberger <Klara.Schmitzberger@golling.schule>]]
:END: 



** Elisabeth Seigmann
:PROPERTIES:
:EMAIL: [[mailto: Elisabeth Seigmann <Elisabeth.Seigmann@golling.schule>]]
:END: 



** Bianca Spagolla
:PROPERTIES:
:EMAIL: [[mailto: Bianca Spagolla <Bianca.Spagolla@golling.schule>]]
:END: 



** Ilija Zivkovic
:PROPERTIES:
:EMAIL: [[mailto: Ilija Zivkovic <Ilija.Zivkovic@golling.schule>]]
:END: 





* Reflexionen

